# StairsAttrStringerCarriage Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsAttrStringerCarriage Property
ParameterTypeId Class See Also
---
"Stringer Carriage Height"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsAttrStringerCarriage { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsAttrStringerCarriage As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsAttrStringerCarriage {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace